In [1]:
import sqlite3

try:
    with sqlite3.connect(":memory:") as conn:
        print(f"Opened SQLite database with version {sqlite3.sqlite_version} successfully.")

except sqlite3.OperationalError as e:
    print("Failed to open database:", e)

Opened SQLite database with version 3.43.2 successfully.

In [2]:
cs = conn.cursor()

In [3]:
with open('customers.sql', 'r') as file:
    sql = file.read()

cs.executescript(sql)

conn.commit()

In [ ]:
cs.execute("SELECT * FROM customers")

rows = cs.fetchall()
for i, row in enumerate(rows):
    if(i == 5):
        break
    print(row)

(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')

In [5]:
# SQL Select

cs.execute("SELECT CustomerName, City FROM Customers;")
row = cs.fetchone()
print(row)

cs.execute("SELECT * FROM Customers;")
row = cs.fetchone()
print(row)

('Alfreds Futterkiste', 'Berlin')
(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')

In [6]:
# SQL Select Distinct

cs.execute("SELECT DISTINCT country FROM customers;")
rows = cs.fetchall()
for row in rows:
    print(row)

('Germany',)
('Mexico',)
('UK',)
('Sweden',)
('France',)
('Spain',)
('Canada',)
('Argentina',)
('Switzerland',)
('Brazil',)
('Austria',)
('Italy',)
('Portugal',)
('USA',)
('Venezuela',)
('Ireland',)
('Belgium',)
('Norway',)
('Denmark',)
('Finland',)
('Poland',)

In [7]:
# SQL Where

cs.execute("SELECT * FROM Customers \
    WHERE Country='Mexico';")
rows = cs.fetchmany(5)
for row in rows:
    print(row)

(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(13, 'Centro comercial Moctezuma', 'Francisco Chang', 'Sierras de Granada 9993', 'México D.F.', '5022', 'Mexico')
(58, 'Pericles Comidas clásicas', 'Guillermo Fernández', 'Calle Dr. Jorge Cash 321', 'México D.F.', '5033', 'Mexico')
(80, 'Tortuga Restaurante', 'Miguel Angel Paolino', 'Avda. Azteca 123', 'México D.F.', '5033', 'Mexico')

In [8]:
with open('products.sql', 'r') as file:
    sql = file.read()

cs.executescript(sql)

conn.commit()

In [9]:
# SQL Order By

cs.execute("SELECT * FROM Products \
    ORDER BY Price;")
rows = cs.fetchmany(5)
for row in rows:
    print(row)

(33, 'Geitost ', 15, 4, '500 g ', 2.5)
(24, 'Guaraná Fantástica ', 10, 1, '12 - 355 ml cans ', 4.5)
(13, 'Konbu ', 6, 8, '2 kg box ', 6)
(52, 'Filo Mix ', 24, 5, '16 - 2 kg boxes ', 7)
(54, 'Tourtière ', 25, 6, '16 pies ', 7.45)

In [10]:
# SQL And

cs.execute("SELECT * \
        FROM Customers \
        WHERE Country = 'Spain' AND CustomerName LIKE 'G%';")

rows = cs.fetchall()
for row in rows:
    print(row)

(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')

In [11]:
# SQL Or

cs.execute("SELECT * \
        FROM Customers \
        WHERE Country = 'Germany' OR Country = 'Spain';")

rows = cs.fetchall()
for row in rows:
    print(row)

(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
(8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', '28023', 'Spain')
(17, 'Drachenblut Delikatessend', 'Sven Ottlieb', 'Walserweg 21', 'Aachen', '52066', 'Germany')
(22, 'FISSA Fabrica Inter. Salchichas S.A.', 'Diego Roel', 'C/ Moralzarzal, 86', 'Madrid', '28034', 'Spain')
(25, 'Frankenversand', 'Peter Franken', 'Berliner Platz 43', 'München', '80805', 'Germany')
(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')
(39, 'Königlich Essen', 'Philip Cramer', 'Maubelstr. 90', 'Brandenburg', '14776', 'Germany')
(44, 'Lehmanns Marktstand', 'Renate Messner', 'Magazinweg 7', 'Frankfurt a.M.', '60528', 'Germany')
(52, 'Morgenstern Gesundkost', 'Alexander Feuer', 'Heerstr. 22', 'Leipzig', '4179', 'Germany')
(56, 'Ottilies Käseladen', 'Henriette Pfalzheim', 'Mehrheimerstr. 369', 'Köln', '50739', 'Germany')
(63, 'QUICK-Stop', 'Horst Kloss', 'Taucherstraße 10', 'Cunewalde', '1307', 'Germany')
(69, 'Romero y tomillo', 'Alejandra Camino', 'Gran Vía, 1', 'Madrid', '28001', 'Spain')
(79, 'Toms Spezialitäten', 'Karin Josephs', 'Luisenstr. 48', 'Münster', '44087', 'Germany')
(86, 'Die Wandernde Kuh', 'Rita Müller', 'Adenauerallee 900', 'Stuttgart', '70563', 'Germany')

In [12]:
# SQL Not

cs.execute("SELECT * FROM customers \
           WHERE NOT country = 'Spain'")
rows = cs.fetchmany(5)
for row in rows:
    print(row)

(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany')
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')

In [13]:
# SQL Insert Into

cs.execute("INSERT INTO customers (customername, contactname, address, city, postalcode, country) \
           VALUES ('Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway')")

cs.execute("SELECT * FROM customers \
           WHERE customername = 'Cardinal'")

print(cs.fetchone())

(92, 'Cardinal', 'Tom B. Erichsen', 'Skagen 21', 'Stavanger', '4006', 'Norway')

In [14]:
# SQL Null Values

print('---NULL Address---')
cs.execute("SELECT customername, contactname, address \
           FROM customers \
           WHERE address IS NULL")
rows = cs.fetchall()
for row in rows:
    print(row)

print('---NOT NULL Address---')
cs.execute("SELECT customername, contactname, address \
           FROM customers \
           WHERE address IS NOT NULL;")
rows = cs.fetchmany(5)
for row in rows:
    print(row)

---NULL Address---
---NOT NULL Address---
('Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57')
('Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222')
('Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312')
('Around the Horn', 'Thomas Hardy', '120 Hanover Sq.')
('Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8')

In [15]:
# SLQ Update

cs.execute("UPDATE customers \
           SET contactname = 'Alfred Schmidt', city = 'Frankfurt' \
           WHERE customerid = 1;")

cs.execute("SELECT * FROM customers \
           WHERE customerid = 1;")
print(cs.fetchone())

conn.commit()

(1, 'Alfreds Futterkiste', 'Alfred Schmidt', 'Obere Str. 57', 'Frankfurt', '12209', 'Germany')

In [16]:
# SQL Delete

cs.execute("SELECT * FROM customers")
print(f"DELETE 전 레코드 개수: {len(cs.fetchall())}")

cs.execute("DELETE FROM customers \
           WHERE customername = 'Alfreds Futterkiste';")

cs.execute("SELECT * FROM customers")
print(f"DELETE 후 레코드 개수: {len(cs.fetchall())}")

conn.commit()

DELETE 전 레코드 개수: 92
DELETE 후 레코드 개수: 91

In [17]:
# SQL Select Top

cs.execute("SELECT * FROM customers \
           LIMIT 3")

rows = cs.fetchall()
for row in rows:
    print(row)

(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')

In [18]:
# SQL Min and Max

cs.execute("SELECT MIN(price) FROM products")
row = cs.fetchall()
print(f"최저가 상품의 가격: {row}")

cs.execute("SELECT MAX(price) FROM products")
row = cs.fetchall()
print(f"최고가 상품의 가격: {row}")

최저가 상품의 가격: [(2.5,)]
최고가 상품의 가격: [(263.5,)]

In [19]:
# SQL Count

cs.execute("SELECT COUNT(*) \
           FROM products;")
print(f"상품의 개수: {cs.fetchone()}")

cs.execute("SELECT COUNT(*) \
           FROM products \
           WHERE price > 20")
print(f"20달러 이상의 가격을 가진 제품의 개수: {cs.fetchall()}")

cs.execute("SELECT COUNT(DISTINCT price) \
           FROM products")
print(f"서로 다른 가격의 개수: {cs.fetchall()}")

상품의 개수: (77,)
20달러 이상의 가격을 가진 제품의 개수: [(37,)]
서로 다른 가격의 개수: [(62,)]

In [20]:
with open('orderdetails.sql', 'r') as file:
    sql = file.read()

cs.executescript(sql)

conn.commit()

In [21]:
# SQL Sum

cs.execute("SELECT SUM(quantity) \
           FROM orderdetails;")
print(f"전체 주문 상품의 개수: {cs.fetchall()}")

cs.execute("SELECT SUM(quantity) \
           FROM orderdetails \
           WHERE productid = 11;")
print(f"상품 번호 11번 상품의 전체 주문 개수: {cs.fetchall()}")

전체 주문 상품의 개수: [(12743,)]
상품 번호 11번 상품의 전체 주문 개수: [(182,)]

In [22]:
# SQL Avg

cs.execute("SELECT AVG(price) \
           FROM products;")
print(f"전체 상품 가격의 평균: {cs.fetchall()}")

cs.execute("SELECT AVG(price) \
           FROM products \
           WHERE categoryid = 1;")
print(f"카테고리 번호가 1인 상품 가격의 평균: {cs.fetchall()}")

cs.execute("SELECT * FROM products \
           WHERE price > (SELECT AVG(price) FROM products);")
print(f"---상품의 가격이 평균 가격보다 높은 상품들---")
rows = cs.fetchall()
for row in rows:
    print(row)

전체 상품 가격의 평균: [(28.866363636363637,)]
카테고리 번호가 1인 상품 가격의 평균: [(37.979166666666664,)]
---상품의 가격이 평균 가격보다 높은 상품들---
(7, "Uncle Bob's Organic Dried Pears ", 3, 7, '12 - 1 lb pkgs. ', 30)
(8, 'Northwoods Cranberry Sauce ', 3, 2, '12 - 12 oz jars ', 40)
(9, 'Mishi Kobe Niku ', 4, 6, '18 - 500 g pkgs. ', 97)
(10, 'Ikura ', 4, 8, '12 - 200 ml jars ', 31)
(12, 'Queso Manchego La Pastora ', 5, 4, '10 - 500 g pkgs. ', 38)
(17, 'Alice Mutton ', 7, 6, '20 - 1 kg tins ', 39)
(18, 'Carnarvon Tigers ', 7, 8, '16 kg pkg. ', 62.5)
(20, "Sir Rodney's Marmalade ", 8, 3, '30 gift boxes ', 81)
(26, 'Gumbär Gummibärchen ', 11, 3, '100 - 250 g bags ', 31.23)
(27, 'Schoggi Schokolade ', 11, 3, '100 - 100 g pieces ', 43.9)
(28, 'Rössle Sauerkraut ', 12, 7, '25 - 825 g cans ', 45.6)
(29, 'Thüringer Rostbratwurst ', 12, 6, '50 bags x 30 sausgs. ', 123.79)
(32, 'Mascarpone Fabioli ', 14, 4, '24 - 200 g pkgs. ', 32)
(38, 'Côte de Blaye ', 18, 1, '12 - 75 cl bottles ', 263.5)
(43, 'Ipoh Coffee ', 20, 1, '16 - 500 g tins ', 46)
(51, 'Manjimup Dried Apples ', 24, 7, '50 - 300 g pkgs. ', 53)
(53, 'Perth Pasties ', 24, 6, '48 pieces ', 32.8)
(56, 'Gnocchi di nonna Alice ', 26, 5, '24 - 250 g pkgs. ', 38)
(59, 'Raclette Courdavault ', 28, 4, '5 kg pkg. ', 55)
(60, 'Camembert Pierrot ', 28, 4, '15 - 300 g rounds ', 34)
(62, 'Tarte au sucre ', 29, 3, '48 pies ', 49.3)
(63, 'Vegie-spread ', 7, 2, '15 - 625 g jars ', 43.9)
(64, 'Wimmers gute Semmelknödel ', 12, 5, '20 bags x 4 pieces ', 33.25)
(69, 'Gudbrandsdalsost ', 15, 4, '10 kg pkg. ', 36)
(72, 'Mozzarella di Giovanni ', 14, 4, '24 - 200 g pkgs. ', 34.8)

In [23]:
# SQL Like

cs.execute("SELECT * FROM customers \
           WHERE customername LIKE 'a%';")
rows = cs.fetchmany(3)
print("---a로 시작하는 이름을 가진 고객 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE city LIKE 'L_nd__'")
rows = cs.fetchmany(3)
print("---L_nd__와 같은 이름의 도시에 살고 있는 고객 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE city LIKE '%L%';")
rows = cs.fetchmany(3)
print("---도시 이름 L이 들어가는 고객의 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE customername LIKE 'La%';")
rows = cs.fetchmany(3)
print("---이름이 La로 시작하는 고객의 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE customername LIKE 'a%' OR customername LIKE 'b%';")
rows = cs.fetchmany(3)
print("---이름이 a 또는 b로 시작하는 고객의 정보---")
for row in rows:
    print(row)
print()

---a로 시작하는 이름을 가진 고객 정보---
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')

---L_nd__와 같은 이름의 도시에 살고 있는 고객 정보---
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')
(16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK')

---도시 이름 L이 들어가는 고객의 정보---
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(9, "Bon app'", 'Laurence Lebihans', '12, rue des Bouchers', 'Marseille', '13008', 'France')

---이름이 La로 시작하는 고객의 정보---
(40, "La corne d'abondance", 'Daniel Tonini', "67, avenue de l'Europe", 'Versailles', '78000', 'France')
(41, "La maison d'Asie", 'Annette Roulet', '1 rue Alsace-Lorraine', 'Toulouse', '31000', 'France')
(42, 'Laughing Bacchus Wine Cellars', 'Yoshi Tannamuri', '1900 Oak St.', 'Vancouver', 'V3F 2K1', 'Canada')

---이름이 a 또는 b로 시작하는 고객의 정보---
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')

In [24]:
cs.execute("SELECT * FROM customers \
           WHERE customername LIKE '%a';")
rows = cs.fetchmany(3)
print("---이름이 a로 끝나는 고객의 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE customername LIKE 'b%s';")
rows = cs.fetchmany(3)
print("---이름이 b로 시작해 s로 끝나는 고객의 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE customername LIKE '%or%';")
rows = cs.fetchmany(3)
print("---이름 가운데에 or이 포함된 고객의 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE customername LIKE 'a__%';")
rows = cs.fetchmany(3)
print("---이름이 a로 시작하고 세 글자 이상인 고객의 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE customername LIKE '_r%';")
rows = cs.fetchmany(3)
print("---이름 두 번째 글자가 r인 고객의 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE country LIKE 'Spain';")
rows = cs.fetchmany(3)
print("---국가가 스페인인 고객의 정보---")
for row in rows:
    print(row)
print()

---이름이 a로 끝나는 고객의 정보---
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(13, 'Centro comercial Moctezuma', 'Francisco Chang', 'Sierras de Granada 9993', 'México D.F.', '5022', 'Mexico')
(30, 'Godos Cocina Típica', 'José Pedro Freyre', 'C/ Romero, 33', 'Sevilla', '41101', 'Spain')

---이름이 b로 시작해 s로 끝나는 고객의 정보---
(7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', '67000', 'France')
(8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', '28023', 'Spain')
(11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')

---이름 가운데에 or이 포함된 고객의 정보---
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(36, 'Hungry Coyote Import Store', 'Yoshi Latimer', 'City Center Plaza 516 Main St.', 'Elgin', '97827', 'USA')

---이름이 a로 시작하고 세 글자 이상인 고객의 정보---
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')

---이름 두 번째 글자가 r인 고객의 정보---
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(17, 'Drachenblut Delikatessend', 'Sven Ottlieb', 'Walserweg 21', 'Aachen', '52066', 'Germany')
(20, 'Ernst Handel', 'Roland Mendel', 'Kirchgasse 6', 'Graz', '8010', 'Austria')

---국가가 스페인인 고객의 정보---
(8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', '28023', 'Spain')
(22, 'FISSA Fabrica Inter. Salchichas S.A.', 'Diego Roel', 'C/ Moralzarzal, 86', 'Madrid', '28034', 'Spain')
(29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain')

In [25]:
# SQL Wildcards

cs.execute("SELECT * FROM customers \
           WHERE customername LIKE '%es';")
rows = cs.fetchmany(3)
print('---이름이 es로 끝나는 고객의 정보---')
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE customername LIKE '%mer%';")
rows = cs.fetchmany(3)
print('---이름에 mer가 들어가는 고객의 정보---')
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE city LIKE '_ondon';")
rows = cs.fetchmany(3)
print('---도시 이름이 첫 글자를 제외하고 ondon으로 이루어진 고객의 정보---')
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE city LIKE 'L___on';")
rows = cs.fetchmany(3)
print('---도시 이름이 L로 시작하고 on으로 끝나는 6글자인 고객의 정보---')
for row in rows:
    print(row)
print()

# SQLite에서는 []와일드카드를 사용할 수 없다.
# 대신 Unix의 파일 이름 탐색 방식인 GLOB을 사용할 수 있다.
# GLOB은 LIKE와는 달리 Case sensitive 하고, LIKE에서 %의 역할을 하는 와일드카드는 *로 사용된다.

cs.execute("SELECT * FROM customers \
           WHERE customername GLOB '[bspBSP]*';")
rows = cs.fetchmany(3)
print('---고객의 이름이 b 또는 s 또는 p로 시작하는 고객의 정보---')
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE customername GLOB '[a-fA-F]*';")
rows = cs.fetchmany(3)
print('---고객의 이름이 a 부터 f 까지의 알파벳으로 시작하는 고객의 정보---')
for row in rows:
    print(row)
print()

---이름이 es로 끝나는 고객의 정보---
(11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')
(23, 'Folies gourmandes', 'Martine Rancé', '184, chaussée de Tournai', 'Lille', '59000', 'France')
(31, 'Gourmet Lanchonetes', 'André Fonseca', 'Av. Brasil, 442', 'Campinas', '04876-786', 'Brazil')

---이름에 mer가 들어가는 고객의 정보---
(13, 'Centro comercial Moctezuma', 'Francisco Chang', 'Sierras de Granada 9993', 'México D.F.', '5022', 'Mexico')
(46, 'LILA-Supermercado', 'Carlos González', 'Carrera 52 con Ave. Bolívar #65-98 Llano Largo', 'Barquisimeto', '3508', 'Venezuela')
(69, 'Romero y tomillo', 'Alejandra Camino', 'Gran Vía, 1', 'Madrid', '28001', 'Spain')

---도시 이름이 첫 글자를 제외하고 ondon으로 이루어진 고객의 정보---
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')
(16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK')

---도시 이름이 L로 시작하고 on으로 끝나는 6글자인 고객의 정보---
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')
(16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK')

---고객의 이름이 b 또는 s 또는 p로 시작하는 고객의 정보---
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
(7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', '67000', 'France')

---고객의 이름이 a 부터 f 까지의 알파벳으로 시작하는 고객의 정보---
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')

In [26]:
with open('orders.sql', 'r') as file:
    sql = file.read()

cs.executescript(sql)

conn.commit()

In [27]:
# SQL In

cs.execute("SELECT * FROM customers \
           WHERE country IN ('Germany', 'France', 'UK');")
rows = cs.fetchmany(5)
print("---국가가 독일, 프랑스, 영국인 고객의 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE country NOT IN ('Germany', 'France', 'UK');")
rows = cs.fetchmany(5)
print("---국가가 독일, 프랑스, 영국이 아닌 고객의 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM customers \
           WHERE customerid IN (SELECT customerid FROM orders)")
rows = cs.fetchmany(5)
print("---실제로 주문을 한 고객의 고객 정보---")
for row in rows:
    print(row)
print()

---국가가 독일, 프랑스, 영국인 고객의 정보---
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany')
(7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', '67000', 'France')
(9, "Bon app'", 'Laurence Lebihans', '12, rue des Bouchers', 'Marseille', '13008', 'France')
(11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK')

---국가가 독일, 프랑스, 영국이 아닌 고객의 정보---
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(8, 'Bólido Comidas preparadas', 'Martín Sommer', 'C/ Araquil, 67', 'Madrid', '28023', 'Spain')
(10, 'Bottom-Dollar Marketse', 'Elizabeth Lincoln', '23 Tsawassen Blvd.', 'Tsawassen', 'T2F 8M4', 'Canada')

---실제로 주문을 한 고객의 고객 정보---
(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico')
(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')
(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK')
(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')
(7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', '67000', 'France')

In [28]:
# SQL Between

cs.execute("SELECT * FROM products \
           WHERE price BETWEEN 10 AND 20;")
rows = cs.fetchmany(3)
print("---가격이 10달러와 20달러 사이인 상품의 정보---")
for row in rows:
    print(row)

cs.execute("SELECT * FROM products \
           WHERE price NOT BETWEEN 10 AND 20;")
rows = cs.fetchmany(3)
print("---가격이 10달러와 20달러 사이가 아닌 상품의 정보---")
for row in rows:
    print(row)

cs.execute("SELECT * FROM products \
           WHERE price BETWEEN 10 AND 20 \
           AND categoryid IN (1, 2, 3);")
rows = cs.fetchmany(3)
print("---가격이 10달러와 20달러 사이면서 카테고리 번호가 1, 2 또는 3인 상품의 정보---")
for row in rows:
    print(row)

cs.execute("SELECT * FROM products \
           WHERE productname BETWEEN 'Carnarvon Tigers' AND 'Chef Anton''s Cajun Seasoning' \
           ORDER BY productname;")
rows = cs.fetchmany(3)
print("---상품 명이 사전 상으로 Carnarvon Tigers와 Chef Anton''s Cajun Seasoning 사이에 있는 상품의 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT * FROM products \
           WHERE productname NOT BETWEEN 'Carnarvon Tigers' AND 'Chef Anton''s Cajun Seasoning' \
           ORDER BY productname;")
rows = cs.fetchmany(3)
print("---상품 명이 사전 상으로 Carnarvon Tigers와 Chef Anton''s Cajun Seasoning 사이에 있지 않은 상품의 정보---")
for row in rows:
    print(row)
print()

# SQLite에서는 직접적인 날짜 자료 타입이 존재하지 않으며, 날짜를 처리할 수 있는 함수만이 존재한다.
# 날짜 함수는 'YYYY-MM-DD'와 같은 포맷만을 지원한다.
# Orders 테이블의 orderdate를 'YYYY-MM-DD' 형태로 바꿔 테이블 생성

# 단순 문자비교
cs.execute("SELECT * FROM orders \
            WHERE orderdate BETWEEN '1996-07-01' AND '1996-07-31';")
rows = cs.fetchmany(3)
print("---주문 날짜가 1996.07.01 ~ 1996.07.31 사이인 주문의 정보1---")
for row in rows:
    print(row)
print()

# DATE 함수를 이용한 비교
cs.execute("SELECT * FROM orders \
            WHERE DATE(orderdate) \
            BETWEEN DATE('1996-07-01') AND DATE('1996-07-31');")
rows = cs.fetchmany(3)
print("---주문 날짜가 1996.07.01 ~ 1996.07.31 사이인 주문의 정보2---")
for row in rows:
    print(row)
print()

---가격이 10달러와 20달러 사이인 상품의 정보---
(1, 'Chais ', 1, 1, '10 boxes x 20 bags ', 18)
(2, 'Chang ', 1, 1, '24 - 12 oz bottles ', 19)
(3, 'Aniseed Syrup ', 1, 2, '12 - 550 ml bottles ', 10)
---가격이 10달러와 20달러 사이가 아닌 상품의 정보---
(4, "Chef Anton's Cajun Seasoning ", 2, 2, '48 - 6 oz jars ', 22)
(5, "Chef Anton's Gumbo Mix ", 2, 2, '36 boxes ', 21.35)
(6, "Grandma's Boysenberry Spread ", 3, 2, '12 - 8 oz jars ', 25)
---가격이 10달러와 20달러 사이면서 카테고리 번호가 1, 2 또는 3인 상품의 정보---
(1, 'Chais ', 1, 1, '10 boxes x 20 bags ', 18)
(2, 'Chang ', 1, 1, '24 - 12 oz bottles ', 19)
(3, 'Aniseed Syrup ', 1, 2, '12 - 550 ml bottles ', 10)
---상품 명이 사전 상으로 Carnarvon Tigers와 Chef Anton''s Cajun Seasoning 사이에 있는 상품의 정보---
(18, 'Carnarvon Tigers ', 7, 8, '16 kg pkg. ', 62.5)
(1, 'Chais ', 1, 1, '10 boxes x 20 bags ', 18)
(2, 'Chang ', 1, 1, '24 - 12 oz bottles ', 19)

---상품 명이 사전 상으로 Carnarvon Tigers와 Chef Anton''s Cajun Seasoning 사이에 있지 않은 상품의 정보---
(17, 'Alice Mutton ', 7, 6, '20 - 1 kg tins ', 39)
(3, 'Aniseed Syrup ', 1, 2, '12 - 550 ml bottles ', 10)
(40, 'Boston Crab Meat ', 19, 8, '24 - 4 oz tins ', 18.4)

---주문 날짜가 1996.07.01 ~ 1996.07.31 사이인 주문의 정보1---
(10248, 90, 5, '1996-07-04', 3)
(10249, 81, 6, '1996-07-05', 1)
(10250, 34, 4, '1996-07-08', 2)

---주문 날짜가 1996.07.01 ~ 1996.07.31 사이인 주문의 정보2---
(10248, 90, 5, '1996-07-04', 3)
(10249, 81, 6, '1996-07-05', 1)
(10250, 34, 4, '1996-07-08', 2)

In [29]:
# SQL Aliases

print("---Alias를 사용한 속성 선택---")
cs.execute("SELECT customerid AS id \
           FROM customers")
rows = cs.fetchmany(3)
for row in rows:
    print(row)

# AS 생략
print("------")
cs.execute("SELECT customerid id \
           FROM customers")
rows = cs.fetchmany(3)
for row in rows:
    print(row)
print()

print("---여러 속성에 Alias 적용---")
cs.execute("SELECT customerid AS id, customername AS customer \
           FROM customers")
rows = cs.fetchmany(3)
for row in rows:
    print(row)
print()

print("---공백이 포함된 Alias---")
cs.execute("SELECT productname AS [My Great Product] \
           FROM products")
rows = cs.fetchmany(3)
for row in rows:
    print(row)
print("------")
cs.execute("SELECT productname AS 'My Great Product' \
           FROM products")
rows = cs.fetchmany(3)
for row in rows:
    print(row)

---Alias를 사용한 속성 선택---
(2,)
(3,)
(4,)
------
(2,)
(3,)
(4,)

---여러 속성에 Alias 적용---
(2, 'Ana Trujillo Emparedados y helados')
(3, 'Antonio Moreno Taquería')
(4, 'Around the Horn')

---공백이 포함된 Alias---
('Chais ',)
('Chang ',)
('Aniseed Syrup ',)
------
('Chais ',)
('Chang ',)
('Aniseed Syrup ',)

In [30]:
# SQL Joins

cs.execute("SELECT orders.orderid, customers.customername, orders.orderdate \
           FROM orders \
           INNER JOIN customers ON orders.customerid = customers.customerid")
rows = cs.fetchmany(3)
print("---주문 고객의 이름과 주문 날짜 정보---")
for row in rows:
    print(row)
print()

---주문 고객의 이름과 주문 날짜 정보---
(10248, 'Wilman Kala', '1996-07-04')
(10249, 'Tradição Hipermercados', '1996-07-05')
(10250, 'Hanari Carnes', '1996-07-08')

In [31]:
with open('categories.sql', 'r') as file:
    sql = file.read()

cs.executescript(sql)

with open('shippers.sql', 'r') as file:
    sql = file.read()

cs.executescript(sql)

conn.commit()

In [32]:
# SQL Inner Join

cs.execute("SELECT productid, productname, categoryname \
           FROM products \
           INNER JOIN categories ON products.categoryid = categories.categoryid;")
rows = cs.fetchmany(3)
print("---상품 별 카테고리의 이름---")
for row in rows:
    print(row)
print()

# 속성 명 직접 명시
cs.execute("SELECT products.productid, products.productname, categories.categoryname \
           FROM products \
           INNER JOIN categories ON products.categoryid = categories.categoryid;")
rows = cs.fetchmany(3)
print("---상품 별 카테고리의 이름2---")
for row in rows:
    print(row)
print()

# INNER JOIN 대신 JOIN 사용
cs.execute("SELECT products.productid, products.productname, categories.categoryname \
           FROM products \
           JOIN categories ON products.categoryid = categories.categoryid;")
rows = cs.fetchmany(3)
print("---상품 별 카테고리의 이름3---")
for row in rows:
    print(row)
print()

# 세 테이블 조인
cs.execute("SELECT orders.orderid, customers.customername, shippers.shippername \
           FROM ((orders \
           INNER JOIN customers ON orders.customerid = customers.customerid) \
           INNER JOIN shippers ON orders.shipperid = shippers.shipperid)")
rows = cs.fetchmany(3)
print("---주문별 주문자의 이름과 운송회사---")
for row in rows:
    print(row)

---상품 별 카테고리의 이름---
(1, 'Chais ', 'Beverages ')
(2, 'Chang ', 'Beverages ')
(3, 'Aniseed Syrup ', 'Condiments ')

---상품 별 카테고리의 이름2---
(1, 'Chais ', 'Beverages ')
(2, 'Chang ', 'Beverages ')
(3, 'Aniseed Syrup ', 'Condiments ')

---상품 별 카테고리의 이름3---
(1, 'Chais ', 'Beverages ')
(2, 'Chang ', 'Beverages ')
(3, 'Aniseed Syrup ', 'Condiments ')

---주문별 주문자의 이름과 운송회사---
(10248, 'Wilman Kala', 'Federal Shipping ')
(10249, 'Tradição Hipermercados', 'Speedy Express ')
(10250, 'Hanari Carnes', 'United Package ')

In [33]:
# SQL Left Join

cs.execute("SELECT customers.customername, orders.orderid \
           FROM customers \
           LEFT JOIN orders ON customers.customerid = orders.customerid \
           ORDER BY customers.customername")
rows = cs.fetchmany(3)
print("---고객의 이름과 주문 존재시 주문 번호 정보---")
for row in rows:
    print(row)

---고객의 이름과 주문 존재시 주문 번호 정보---
('Ana Trujillo Emparedados y helados', 10308)
('Antonio Moreno Taquería', 10365)
('Around the Horn', 10355)

In [34]:
with open('employees.sql', 'r') as file:
    sql = file.read()

cs.executescript(sql)

conn.commit()

In [39]:
# SQL Right Join

cs.execute("SELECT orders.orderid, employees.lastname, employees.firstname \
           FROM orders \
           RIGHT JOIN employees ON orders.employeeid = employees.employeeid \
           ORDER BY orders.orderid")
rows = cs.fetchmany(3)
print("---직원의 이름과 주문이 존재할 시 주문 번호 정보---")
for row in rows:
    print(row)

---직원의 이름과 주문이 존재할 시 주문 번호 정보---
(None, 'West ', 'Adam ')
(10248, 'Buchanan ', 'Steven ')
(10249, 'Suyama ', 'Michael ')

In [44]:
# SQL Full Join

cs.execute("SELECT customers.customername, orders.orderid \
           FROM customers \
           FULL OUTER JOIN orders ON customers.customerid = orders.customerid \
           ORDER BY customers.customername")
rows = cs.fetchmany(3)
print("---한쪽 데이터 존재 여부와 관계없이 고객 이름과 주문 번호 정보---")
for row in rows:
    print(row)

---한쪽 데이터 존재 여부와 관계없이 고객 이름과 주문 번호 정보---
('Ana Trujillo Emparedados y helados', 10308)
('Antonio Moreno Taquería', 10365)
('Around the Horn', 10355)

In [45]:
# SQL Self Join

cs.execute("SELECT A.customername AS CustomerName1, B.customername AS Customername2, A.city \
           FROM customers A, customers B \
           WHERE A.customerid <> B.customerid \
           AND A.city = B.city \
           ORDER BY A.city")
rows = cs.fetchmany(5)
print("---같은 도시에 사는 고객들의 이름과 도시 정보---")
for row in rows:
    print(row)

---같은 도시에 사는 고객들의 이름과 도시 정보---
('Cactus Comidas para llevar', 'Océano Atlántico Ltda.', 'Buenos Aires')
('Cactus Comidas para llevar', 'Rancho grande', 'Buenos Aires')
('Océano Atlántico Ltda.', 'Cactus Comidas para llevar', 'Buenos Aires')
('Océano Atlántico Ltda.', 'Rancho grande', 'Buenos Aires')
('Rancho grande', 'Cactus Comidas para llevar', 'Buenos Aires')

In [46]:
with open('suppliers.sql', 'r') as file:
    sql = file.read()

cs.executescript(sql)

conn.commit()

In [60]:
# SQL Union

cs.execute("SELECT city FROM customers \
           UNION \
           SELECT city FROM suppliers \
           ORDER BY city")
rows = cs.fetchmany(5)
print("---고객과 판매자의 중복을 제외한 모든 도시 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT city FROM customers \
           UNION ALL\
           SELECT city FROM suppliers \
           ORDER BY city")
rows = cs.fetchmany(3)
print("---고객과 판매자의 중복을 포함한 모든 도시 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT city FROM customers \
           WHERE country = 'Germany' \
           UNION\
           SELECT city FROM suppliers \
           WHERE country = 'Germany' \
           ORDER BY city")
rows = cs.fetchmany(3)
print("---독일에 사는 고객과 판매자의 중복을 제외한 모든 도시 정보---")
for row in rows:
    print(row)
print()

cs.execute("SELECT city FROM customers \
           WHERE country = 'Germany' \
           UNION ALL\
           SELECT city FROM suppliers \
           WHERE country = 'Germany' \
           ORDER BY city")
rows = cs.fetchmany(3)
print("---독일에 사는 고객과 판매자의 중복을 포함한 모든 도시 정보---")
for row in rows:
    print(row)
print()


cs.execute("SELECT 'Customer' AS type, contactname, city, country \
           FROM customers \
           UNION \
           SELECT 'Supplier', contactname, city, country \
           FROM suppliers")
rows = cs.fetchmany(3)
print("---고객과 판매자를 구분해 데이터 병합---")
for row in rows:
    print(row)

---고객과 판매자의 중복을 제외한 모든 도시 정보---
('Aachen',)
('Albuquerque',)
('Anchorage',)
('Ann Arbor ',)
('Annecy ',)

---고객과 판매자의 중복을 포함한 모든 도시 정보---
('Aachen',)
('Albuquerque',)
('Anchorage',)

---독일에 사는 고객과 판매자의 중복을 제외한 모든 도시 정보---
('Aachen',)
('Brandenburg',)
('Cunewalde',)

---독일에 사는 고객과 판매자의 중복을 포함한 모든 도시 정보---
('Aachen',)
('Brandenburg',)
('Cunewalde',)

---고객과 판매자를 구분해 데이터 병합---
('Customer', 'Alejandra Camino', 'Madrid', 'Spain')
('Customer', 'Alexander Feuer', 'Leipzig', 'Germany')
('Customer', 'Ana Trujillo', 'México D.F.', 'Mexico')

In [61]:
# SQL Group By

cs.execute("SELECT COUNT(customerid), country \
           FROM customers \
           GROUP BY country;")
rows = cs.fetchmany(3)
print("---국가별 고객의 수---")
for row in rows:
    print(row)
print()

cs.execute("SELECT COUNT(customerid), country \
           FROM customers \
           GROUP BY country \
           ORDER BY COUNT(customerid) DESC;")
rows = cs.fetchmany(3)
print("---국가별 고객의 수 내림차순 정렬---")
for row in rows:
    print(row)
print()

cs.execute("SELECT shippers.shippername, COUNT(orders.orderid) AS NumberOfOrders \
           FROM orders \
           LEFT JOIN shippers ON orders.shipperid = shippers.shipperid \
           GROUP BY shippername;")
rows = cs.fetchmany(3)
print("----운송회사별 주문의 수---")
for row in rows:
    print(row)
print()

---국가별 고객의 수---
(3, 'Argentina')
(2, 'Austria')
(2, 'Belgium')

---국가별 고객의 수 내림차순 정렬---
(13, 'USA')
(11, 'France')
(10, 'Germany')

----운송회사별 주문의 수---
('Federal Shipping ', 68)
('Speedy Express ', 54)
('United Package ', 74)

In [65]:
# SQL Having

cs.execute("SELECT COUNT(customerid), country \
           FROM customers \
           GROUP BY country \
           HAVING COUNT(customerid) > 5;")
rows = cs.fetchmany(3)
print("---고객의 수가 5명보다 많은 국가---")
for row in rows:
    print(row)
print()

cs.execute("SELECT COUNT(customerid), country \
           FROM customers \
           GROUP BY country \
           HAVING COUNT(customerid) > 5 \
           ORDER BY COUNT(customerid) DESC;")
rows = cs.fetchmany(3)
print("---고객의 수가 5명보다 많은 국가 내림차순 정렬---")
for row in rows:
    print(row)
print()

cs.execute("SELECT employees.lastname, COUNT(orders.orderid) AS NumberOfOrders \
           FROM (orders \
           INNER JOIN employees ON orders.employeeid = employees.employeeid) \
           GROUP BY lastname \
           HAVING COUNT(orders.orderid) > 10")
rows = cs.fetchmany(3)
print("--- ---")
for row in rows:
    print(row)
print()

cs.execute("SELECT employees.lastname, COUNT(orders.orderid) AS NumberOfOrders \
           FROM orders \
           INNER JOIN employees ON orders.employeeid = employees.employeeid \
           WHERE lastname = 'Davolio' OR lastname = 'Fuller' \
           GROUP BY lastname \
           HAVING COUNT(orders.orderid) > 25")
rows = cs.fetchmany(3)
print("--- ---")
for row in rows:
    print(row)
print()

---고객의 수가 5명보다 많은 국가---
(9, 'Brazil')
(11, 'France')
(10, 'Germany')

---고객의 수가 5명보다 많은 국가 내림차순 정렬---
(13, 'USA')
(11, 'France')
(10, 'Germany')

--- ---
('Buchanan ', 11)
('Callahan ', 27)
('Davolio ', 29)

--- ---